<?php

namespace Database\Seeders;

use App\Models\Good;
use App\Models\Goods\Category;
use App\Models\Goods\Group;
use Illuminate\Database\Seeder;

class GoodsSeeder extends Seeder
{
    public function run(): void
    {
        \DB::transaction(function () {
            $groups = [
                '100-199 Car Refinish - для покраски авторемонта',
                '200-299 Decorative Coating - для строительства и ремонта',
                '300-399 Wood Coating - для обработки древесины',
                '400-499 Industrial Coating - для промышленности',
                '500-599 Car Refinish - автохимия, автокосметика и оборудование для моек',
                '600-699 Non Paint - инструменты, акссесуары и расходные материалы',
                '700-... Другое'
            ];
            $categories = [
                [
                    1 => '1 - Отправка товара',
                    100 => '100 - MIXON - CAR REFINISH',
                    101 => '101 - MIXON - Автоэмали  SYNTHETIC',
                    102 => '102 - MIXON - Автоэмали  ACRYL',
                    103 => '103 - MIXON - Автоэмали  METALLIC',
                    104 => '104 - MIXON - Автоэмали в аэрозольных баллонах',
                    105 => '105 - MIXON - Грунт 992',
                    110 => '110 - MIXON - CAR REFINISH КАРС',
                    112 => '112 - MIXON - Универс. аэрозольные краски  КАРС',
                    115 => '115 - MIXON - CAR REFINISH SILVER LINE',
                    116 => '116 - MIXON - Универс. аэрозольные краски  SILVER LINE',
                    120 => '120 - MIX SYSTEM - CAR REFINISH',
                    121 => '121 - MIX SYSTEM - Система автоподбора MС',
                    122 => '122 - MIX SYSTEM - Система автоподбора HA',
                    123 => '123 - MIX SYSTEM - Система автоподбора PC',
                    124 => '124 - MIX SYSTEM - Система автоподбора RC',
                    125 => '125 - MIXON - копии  DUPONT, PPG, MAXMEYER',
                    135 => '135 - DUPONT - Cистема автоподбора',
                    136 => '136 - PPG - Cистема автоподбора',
                    137 => '137 - MAXMEYER - Cистема автоподбора',
                    140 => '140 - MOTIP-DUPLI - Автоэмали в аэрозольных баллонах',
                    141 => '141 - MOTIP-DUPLI - Универс. аэрозольные краски',
                    142 => '142 - MOTIP-DUPLI - Распродажа баллоны 400мл',
                    143 => '143 - MOTIP-DUPLI - Распродажа баллоны 150мл',
                    145 => '145 - BS - CAR REFINISH',
                    199 => '199 - CAR REFINISH - Распродажа',
                ],
                [
                    200 => '200 - MIXON - Водоэмульсионные краски и грунты',
                    201 => '201 - MIXON - Деревозащитные средства  NOVOTEX',
                    202 => '202 - MIXON - Антикоррозийные краски и грунты  МИТАЛ',
                    203 => '203 - MIXON - Универсальные краски для дерева  DOMEX',
                    204 => '204 - MIXON - Краски с молотковым эффектом  ХАМЕРТОН',
                    205 => '205 - MIXON - Краски с металлическим эффектом  MIROX',
                    206 => '206 - MIXON - Универс. краски  HOBBY LACK',
                    207 => '207 - MIXON - Универс. аэроз. краски  HOBBY LACK CK',
                    208 => '208 - MIXON - Вододоэмульсионные краски  TITAN',
                    209 => '209 - MIXON - Грунты влагоизоляторы  AQUASTOP',
                    210 => '210 - MIXON - Тонировочные пасты',
                    211 => '211 - MIXON - Грунты, Краски, Материалы спец. Назначения',
                    212 => '212 - MIXON - Лаки для строительства',
                    213 => '213 - MIXON - Отделочные материалы для фасадов',
                    214 => '214 - MIXON - Аэрозоли специального назначения',
                    217 => '217 - MIXON - Пасты тонировочные  DECOTONER',
                    225 => '225 - MIXON - Пены монтажные  MIXON-FOAM',
                    230 => '230 - MVL - Отделочные материалы для фасадов',
                    231 => '231 - MVL - Водоэмульсионные краски и грунты',
                    232 => '232 - MVL - Декоративные материалы для внутренних работ',
                    240 => '240 - DOMEX - Универс. аэроз. краски  WHITE LINE',
                    242 => '242 - DOMEX - DECORATIVE LINE',
                    245 => '245 - HAMERTON - Аэрозольные краски с молотковым эффектом',
                    250 => '250 - GENC - DECORATIVE COATINGS',
                    255 => '255 - SHEETROCK - Универсальные шпатлевки',
                    260 => '260 - SADOLIN - PINOTEX - Распродажа',
                    299 => '299 - DECORATIVE COATINGS - Распродажа',

                ],
                [
                    300 => '300 - MIXON - WOOD COATINGS',
                    301 => '301 - MIXON - Спиртовые морилки  TINTEKS BASE',
                    302 => '302 - MIXON - Клея для древесины  MIXCOL',
                    303 => '303 - MIXON - Тонировочные пасты WOOD COATINGS',
                    310 => '310 - AKZO NOBEL - WOOD COATINGS',
                    320 => '320 - GENC - WOOD COATINGS',
                    399 => '399 - WOOD COATINGS - Распродажа',

                ],
                [
                    400 => '400 - MIXON - INDUSTRIAL COATINGS',
                    499 => '499 - INDUSTRIAL COATINGS - Распродажа',

                ],
                [
                    500 => '500 - MIXON - CAR WASH LINE',
                    501 => '501 - MIXON - HOBBY LINE',
                    503 => '503 - MIXON - Химия для автомоек',
                    510 => '510 - MIXON - Расходные материалы для автомоек',
                    511 => '511 - MIXON - Оборудование для автомоек',
                    512 => '512 - MIXON - Тряпки для автомоек',
                    515 => '515 - MIXON - Оборудование для автомоек  TORNADOR',
                    530 => '530 - WASH & DRIVE - CAR WASH LINE',
                    540 => '540 - MEGULAR\'S - Системы для полировки',
                    590 => '590 - MA-FRA - Распродажа',
                    599 => '599 - CAR CARE - Распродажа',

                ],
                [
                    600 => '600 - MIXON - Покрасочные пистолеты',
                    601 => '601 - MIXON - Скотч MIXON AUTO',
                    602 => '602 - MIXON - Скотч MIXON MALER',
                    603 => '603 - MIXON - Кисти и Валики',
                    604 => '604 - MIXON - Расходные материалы для малярок',
                    605 => '605 - MIXON - Защитная пленка',
                    606 => '606 - MIXON - Бумага для малярок и автомоек',
                    607 => '607 - MIXON - Оборудование для малярок',
                    620 => '620 - MIXON - Растворители',
                    621 => '621 - MIXON - Растворители ГОСТ',
                    630 => '630 - AUTOTRADE - Растворители',
                    640 => '640 - SMIRDEX - Абразивная бумага',
                    650 => '650 - AEROMETAL - Покрасочные пистолеты',
                    652 => '652 - ITALCO - Покрасочные пистолеты',
                    660 => '660 - PRODYVER - Бумага для малярок и автомоек',
                    690 => '690 - ТАРА',
                    694 => '694 - AEROMETAL - Распродажа',
                    695 => '695 - SMIRDEX - Абразивная бумага - Распродажа',
                    696 => '696 - 3M - Абразивная бумага - Распродажа',
                    697 => '697 - SIA - Абразивная бумага - Распродажа',
                    698 => '698 - MIXON - Покрасочные пистолеты (Распродажа)',
                    699 => '699 - NON PAINT - Распродажа',

                ],
                [
                    700 => '700 - MIXON - чистящие и моющие средства  HOME LINE',
                    3000 => '3000 - MікС - рекламная продукция',
                    9000 => '9000 - Распродажа',
                ]
            ];

            if (!Group::exists()) {
                foreach ($groups as $key => $value) {
                    $group = Group::create(['name' => $value]);
                    collect($categories[$key])
                        ->map(fn($value, $key) => ['group_id' => $group->id, 'name' => $value, 'number' => $key])
                        ->each(fn($attrs) => Category::create($attrs));
                }
            }
        });

        $skus = [
            '105-01-2' => 'Шпатлевка универсальная MIXON-UNI  2кг',
            '3000-01-2' => 'Шпатлевка универсальная MIXON-3000  2кг',
            '106-01-2' => 'Шпатлевка алюминиевая MIXON-ALU  1,8кг',
            '107-01-2' => 'Шпатлевка со стекловолокном MIXON-FIBER  1,8кг',
            '120-01-2' => 'Шпатлевка универс. SILVER LINE MIXON SUPER SOFT  1,7кг',
            '121-01-2' => 'Шпатлевка алюм. SILVER LINE MIXON ALUMINIUM  1,8кг',
            '122-01-2' => 'Шпатлевка со стеклов. SILVER LINE MIXON FIBER GLASS  1,8кг',
            '123-01-2' => 'Шпатлевка отделочн. SILVER LINE MIXON SUPER FINE  1,8кг',
            '301-01-1' => 'Акриловый грунт MIXON 3+1 серый  1л',
            '301-02-1' => 'Акриловый грунт MIXON 3+1 белый  1л',
            '301-03-1' => 'Акриловый грунт MIXON 3+1 черный  1л',
            '301-04-1' => 'Акриловый грунт MIXON 3+1 желтый  1л',
            '301-05-1' => 'Акриловый грунт MIXON 3+1 красный  1л',
            '311-01-03' => 'Отвердитель MIXON 3+1  330мл ',
            '501-01-1' => 'Акриловый грунт MIXON 5+1 серый  1л',
            '501-02-1' => 'Акриловый грунт MIXON 5+1 белый  1л',
        ];

        foreach ($skus as $sku => $name) {
            Good::create([
                'category_id' => Category::inRandomOrder()->first()->id,
                'sku' => $sku,
                'name' => $name,
                'rrp' => random_int(50, 500)
            ]);
        }
    }
}
