<template>
  <div class="container">
    <div class="center">
      <b>Уважаемые господа!</b><br> Вам предлагается
      система on-line заказа, предназначенная для оперативного и конфиденциального получения от Вас заявки на наш товар.
      Эта система позволяет просмотреть весь ассортимент предлагаемого товара, выбрать интересующие Вас позиции в нужном
      для Вас количестве и отправить заявку нашему сотруднику для оформления отгрузки.<br><br> <b>Как сделать
      онлайн-заказ.</b><br> Для начала работы с on-line заказом, Вам необходимо заполнить регистрационную форму, все
      поля которой обязательны к заполнению. Логин и пароль выберите для себя самостоятельно. Ограничений по символам
      нет. Пройдя регистрацию, в дальнейшем, Вам будет необходимо только подтвердить логин и пароль для доступа к форме
      заказа.<br><br> В форме заказа Вы попадаете в справочник товара. Для более удобного просмотра, весь товар разбит
      на группы. В верхней части экрана, в выпадающем списке, Вы выбираете интересующую Вас группу. Выбрав нужную
      группу, нажимаете кнопку «Найти» и получаете, в нижней части экрана, весь список товаров данной группы. Напротив
      каждого наименования товара находится поле ввода.<br><br> В него вводится интересующее Вас количество товара.
      Просмотрев весь список и введя выбранное количество, опускаетесь в самый низ списка товара, пока не появится
      кнопка выбора «Выбрать». Нажав ее, весь выбранный товар из данного списка запомнится (это можно заменить просто
      нажатием клавиши Enter во время нахождения курсора в поле ввода). Далее Вы можете выбрать другую группу товара и
      проделать все вышеперечисленные действия.<br><br> Закончив выборку товара, Вы можете просмотреть выбранные позиции
      кнопкой «Содержимое заказа». В появляющейся форме содержится информация о выбранных Вами позициях, количестве,
      ценах и весе товара. Также присутствуют общие вес и стоимость всего заказа. Если необходимо, Вы можете
      отредактировать количество товара в каждой выбранной Вами товарной позиции или добавить товарную позицию. После
      внесения изменений в заказ небходимо нажать кнопку «Пересчитать». Подтверждение успешной отправки формы заказа Вы
      увидите на своем мониторе.<br><br> Спасибо за оказанное внимание и доверие к нашей фирме. Надеемся, что такая
      форма работы сохранит Ваше время и доставит удовольствие.
    </div>
  </div>
</template>

<script lang="ts">
import {defineComponent, onMounted} from 'vue'
import {setCurrentPageTitle} from '@/metronic/core/helpers/breadcrumb'
import Layout from '@/layouts/Layout.vue'

export default defineComponent({
  layout: Layout,
  setup() {
    onMounted(() => {
      setCurrentPageTitle('Dashboard')
    })
  }
})
</script>

<style scoped>
.container {
  margin-top: 200px;
}
</style>
